notebooks/data.org
#+OPTIONS: ^:nil toc:nil num:nil
#+BEGIN_EXPORT html
---
layout: default
title: Data Reference
---
#+END_EXPORT

This page serves as a dataset reference. It currently shows a header
for each dataset, but I'll update it with notes as I uncover important
aspects of the data.

Original source: https://www.kaggle.com/c/mens-machine-learning-competition-2019/data

#+TOC: headlines 2

* Data Section 1 - The Basics
#+begin_src python :session :exports both :results output :eval never-export
  import pandas as pd
  import numpy as np
  from tabulate import tabulate
  import os
  def print_df(df):
      print(tabulate(df, headers="keys",tablefmt="html"))
  print(os.listdir('../input/datafiles/'))
#+end_src

#+RESULTS:
: ['SecondaryTourneyTeams.csv', 'Players_2012.csv', 'GameCities.csv', 'Events_2010.csv', 'Players_2013.csv', 'Players_2017.csv', 'Events_2011.csv', 'Events_2017.csv', 'Players_2014.csv', 'Events_2018.csv', 'NCAATourneySlots.csv', 'MasseyOrdinals.csv', 'TeamConferences.csv', 'NCAATourneyDetailedResults.csv', 'NCAATourneySeedRoundSlots.csv', 'NCAATourneySeeds.csv', 'NCAATourneyCompactResults.csv', 'TeamCoaches.csv', 'Players_2015.csv', 'Seasons.csv', 'Cities.csv', 'Players_2016.csv', 'Events_2014.csv', 'Players_2018.csv', 'Events_2012.csv', 'Events_2013.csv', 'SecondaryTourneyCompactResults.csv', 'Players_2011.csv', 'RegularSeasonCompactResults.csv', 'Events_2016.csv', 'Events_2015.csv', 'Teams.csv', 'Players_2010.csv', 'Conferences.csv', 'ConferenceTourneyGames.csv', 'TeamSpellings.csv', 'RegularSeasonDetailedResults.csv']

** RegularSeasonCompactResults
#+begin_src python :session :exports both :results output html :eval never-export
  RegularSeasonCompactResults = pd.read_csv('../input/datafiles/RegularSeasonCompactResults.csv')
  print("size = ", RegularSeasonCompactResults.shape)
  print_df(RegularSeasonCompactResults.head())
#+end_src

#+RESULTS:
#+BEGIN_EXPORT html
size =  (156089, 8)
<table>
<thead>
<tr><th style="text-align: right;">  </th><th style="text-align: right;">  Season</th><th style="text-align: right;">  DayNum</th><th style="text-align: right;">  WTeamID</th><th style="text-align: right;">  WScore</th><th style="text-align: right;">  LTeamID</th><th style="text-align: right;">  LScore</th><th>WLoc  </th><th style="text-align: right;">  NumOT</th></tr>
</thead>
<tbody>
<tr><td style="text-align: right;"> 0</td><td style="text-align: right;">    1985</td><td style="text-align: right;">      20</td><td style="text-align: right;">     1228</td><td style="text-align: right;">      81</td><td style="text-align: right;">     1328</td><td style="text-align: right;">      64</td><td>N     </td><td style="text-align: right;">      0</td></tr>
<tr><td style="text-align: right;"> 1</td><td style="text-align: right;">    1985</td><td style="text-align: right;">      25</td><td style="text-align: right;">     1106</td><td style="text-align: right;">      77</td><td style="text-align: right;">     1354</td><td style="text-align: right;">      70</td><td>H     </td><td style="text-align: right;">      0</td></tr>
<tr><td style="text-align: right;"> 2</td><td style="text-align: right;">    1985</td><td style="text-align: right;">      25</td><td style="text-align: right;">     1112</td><td style="text-align: right;">      63</td><td style="text-align: right;">     1223</td><td style="text-align: right;">      56</td><td>H     </td><td style="text-align: right;">      0</td></tr>
<tr><td style="text-align: right;"> 3</td><td style="text-align: right;">    1985</td><td style="text-align: right;">      25</td><td style="text-align: right;">     1165</td><td style="text-align: right;">      70</td><td style="text-align: right;">     1432</td><td style="text-align: right;">      54</td><td>H     </td><td style="text-align: right;">      0</td></tr>
<tr><td style="text-align: right;"> 4</td><td style="text-align: right;">    1985</td><td style="text-align: right;">      25</td><td style="text-align: right;">     1192</td><td style="text-align: right;">      86</td><td style="text-align: right;">     1447</td><td style="text-align: right;">      74</td><td>H     </td><td style="text-align: right;">      0</td></tr>
</tbody>
</table>
#+END_EXPORT


** NCAATourneyCompactResults
#+begin_src python :session :exports both :results output html :eval never-export
  NCAATourneyCompactResults = pd.read_csv('../input/datafiles/NCAATourneyCompactResults.csv')
  print("size = ", NCAATourneyCompactResults.shape)
  print_df(NCAATourneyCompactResults.head())
#+end_src

#+RESULTS:
#+BEGIN_EXPORT html
size =  (2184, 8)
<table>
<thead>
<tr><th style="text-align: right;">  </th><th style="text-align: right;">  Season</th><th style="text-align: right;">  DayNum</th><th style="text-align: right;">  WTeamID</th><th style="text-align: right;">  WScore</th><th style="text-align: right;">  LTeamID</th><th style="text-align: right;">  LScore</th><th>WLoc  </th><th style="text-align: right;">  NumOT</th></tr>
</thead>
<tbody>
<tr><td style="text-align: right;"> 0</td><td style="text-align: right;">    1985</td><td style="text-align: right;">     136</td><td style="text-align: right;">     1116</td><td style="text-align: right;">      63</td><td style="text-align: right;">     1234</td><td style="text-align: right;">      54</td><td>N     </td><td style="text-align: right;">      0</td></tr>
<tr><td style="text-align: right;"> 1</td><td style="text-align: right;">    1985</td><td style="text-align: right;">     136</td><td style="text-align: right;">     1120</td><td style="text-align: right;">      59</td><td style="text-align: right;">     1345</td><td style="text-align: right;">      58</td><td>N     </td><td style="text-align: right;">      0</td></tr>
<tr><td style="text-align: right;"> 2</td><td style="text-align: right;">    1985</td><td style="text-align: right;">     136</td><td style="text-align: right;">     1207</td><td style="text-align: right;">      68</td><td style="text-align: right;">     1250</td><td style="text-align: right;">      43</td><td>N     </td><td style="text-align: right;">      0</td></tr>
<tr><td style="text-align: right;"> 3</td><td style="text-align: right;">    1985</td><td style="text-align: right;">     136</td><td style="text-align: right;">     1229</td><td style="text-align: right;">      58</td><td style="text-align: right;">     1425</td><td style="text-align: right;">      55</td><td>N     </td><td style="text-align: right;">      0</td></tr>
<tr><td style="text-align: right;"> 4</td><td style="text-align: right;">    1985</td><td style="text-align: right;">     136</td><td style="text-align: right;">     1242</td><td style="text-align: right;">      49</td><td style="text-align: right;">     1325</td><td style="text-align: right;">      38</td><td>N     </td><td style="text-align: right;">      0</td></tr>
</tbody>
</table>
#+END_EXPORT

