docs/data.html
---
layout: default
title: Data Reference
---

<p>
This page serves as a dataset reference. It currently shows a header
for each dataset, but I'll update it with notes as I uncover important
aspects of the data.
</p>

<p>
Original source: <a href="https://www.kaggle.com/c/mens-machine-learning-competition-2019/data">https://www.kaggle.com/c/mens-machine-learning-competition-2019/data</a>
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgaded389">Data Section 1 - The Basics</a>
<ul>
<li><a href="#orgf18849c">RegularSeasonCompactResults</a></li>
<li><a href="#orged5104a">NCAATourneyCompactResults</a></li>
<li><a href="#orga179b6b">NCAATourneySeeds</a></li>
<li><a href="#orgb3086d7">Seasons</a></li>
<li><a href="#org0e479ed">Teams</a></li>
<li><a href="#org5f005a6">SampleSubmissionStage1</a></li>
</ul>
</li>
<li><a href="#org3b44356">Data Section 2 - Team Box Scores</a>
<ul>
<li><a href="#orgf7b18e2">RegularSeasonDetailedResults</a></li>
<li><a href="#orgc9abc1f">NCAATourneyDetailedResults</a></li>
</ul>
</li>
<li><a href="#org820d806">Data Section 3 - Geography</a>
<ul>
<li><a href="#orgca5bdfe">Cities</a></li>
<li><a href="#orgd86c509">GameCities</a></li>
</ul>
</li>
<li><a href="#orgf388c4e">Data Section 4 - Public Rankings</a>
<ul>
<li><a href="#orgc6c486d">MasseyOrdinals</a></li>
</ul>
</li>
<li><a href="#orgaee56c7">Data Section 5 - Play by Play</a>
<ul>
<li><a href="#org3993427">Events_2015</a></li>
<li><a href="#org458fbe8">Players_2015</a></li>
</ul>
</li>
<li><a href="#org12bf63b">Data Section 6 - Supplements</a>
<ul>
<li><a href="#org0eddbd3">ConferenceTourneyGames</a></li>
<li><a href="#orga2ae392">TeamCoaches</a></li>
<li><a href="#org541e353">Conferences</a></li>
<li><a href="#orgecdf819">TeamConferences</a></li>
<li><a href="#org7c306c8">SecondaryTourneyTeams</a></li>
<li><a href="#org0292126">SecondaryTourneyCompactResults</a></li>
<li><a href="#org7050d04">NCAATourneySlots</a></li>
<li><a href="#org4068d96">NCAATourneySeedRoundSlots</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgaded389" class="outline-2">
<h2 id="orgaded389">Data Section 1 - The Basics</h2>
<div class="outline-text-2" id="text-orgaded389">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #a020f0;">import</span> pandas <span style="color: #a020f0;">as</span> pd
<span style="color: #a020f0;">import</span> numpy <span style="color: #a020f0;">as</span> np
<span style="color: #a020f0;">from</span> tabulate <span style="color: #a020f0;">import</span> tabulate
<span style="color: #a020f0;">import</span> os
<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">print_df</span>(df):
<span style="background-color: #f2f2f2;"> </span>   <span style="color: #a020f0;">print</span>(tabulate(df, headers=<span style="color: #8b2252;">"keys"</span>,tablefmt=<span style="color: #8b2252;">"html"</span>))
<span style="color: #a020f0;">print</span>(os.listdir(<span style="color: #8b2252;">'../input/datafiles/'</span>))
</pre>
</div>

<pre class="example">
['SecondaryTourneyTeams.csv', 'Players_2012.csv', 'GameCities.csv', 'Events_2010.csv', 'Players_2013.csv', 'Players_2017.csv', 'Events_2011.csv', 'Events_2017.csv', 'Players_2014.csv', 'Events_2018.csv', 'NCAATourneySlots.csv', 'MasseyOrdinals.csv', 'TeamConferences.csv', 'NCAATourneyDetailedResults.csv', 'NCAATourneySeedRoundSlots.csv', 'NCAATourneySeeds.csv', 'NCAATourneyCompactResults.csv', 'TeamCoaches.csv', 'Players_2015.csv', 'Seasons.csv', 'Cities.csv', 'Players_2016.csv', 'Events_2014.csv', 'Players_2018.csv', 'Events_2012.csv', 'Events_2013.csv', 'SecondaryTourneyCompactResults.csv', 'Players_2011.csv', 'RegularSeasonCompactResults.csv', 'Events_2016.csv', 'Events_2015.csv', 'Teams.csv', 'Players_2010.csv', 'Conferences.csv', 'ConferenceTourneyGames.csv', 'TeamSpellings.csv', 'RegularSeasonDetailedResults.csv']

</pre>
</div>
