notebooks/data.org
** NCAATourneySeeds
#+begin_src python :session :exports both :results output html :eval never-export
  NCAATourneySeeds = pd.read_csv('../input/datafiles/NCAATourneySeeds.csv')
  print("size = ", NCAATourneySeeds.shape)
  print_df(NCAATourneySeeds.head())
#+end_src

#+RESULTS:
#+BEGIN_EXPORT html
size =  (2218, 3)
<table>
<thead>
<tr><th style="text-align: right;">  </th><th style="text-align: right;">  Season</th><th>Seed  </th><th style="text-align: right;">  TeamID</th></tr>
</thead>
<tbody>
<tr><td style="text-align: right;"> 0</td><td style="text-align: right;">    1985</td><td>W01   </td><td style="text-align: right;">    1207</td></tr>
<tr><td style="text-align: right;"> 1</td><td style="text-align: right;">    1985</td><td>W02   </td><td style="text-align: right;">    1210</td></tr>
<tr><td style="text-align: right;"> 2</td><td style="text-align: right;">    1985</td><td>W03   </td><td style="text-align: right;">    1228</td></tr>
<tr><td style="text-align: right;"> 3</td><td style="text-align: right;">    1985</td><td>W04   </td><td style="text-align: right;">    1260</td></tr>
<tr><td style="text-align: right;"> 4</td><td style="text-align: right;">    1985</td><td>W05   </td><td style="text-align: right;">    1374</td></tr>
</tbody>
</table>
#+END_EXPORT

** Seasons
#+begin_src python :session :exports both :results output html :eval never-export
  Seasons = pd.read_csv('../input/datafiles/Seasons.csv')
  print("size = ", Seasons.shape)
  print_df(Seasons.head())
#+end_src

#+RESULTS:
#+BEGIN_EXPORT html
size =  (35, 6)
<table>
<thead>
<tr><th style="text-align: right;">  </th><th style="text-align: right;">  Season</th><th>DayZero   </th><th>RegionW  </th><th>RegionX  </th><th>RegionY  </th><th>RegionZ  </th></tr>
</thead>
<tbody>
<tr><td style="text-align: right;"> 0</td><td style="text-align: right;">    1985</td><td>10/29/1984</td><td>East     </td><td>West     </td><td>Midwest  </td><td>Southeast</td></tr>
<tr><td style="text-align: right;"> 1</td><td style="text-align: right;">    1986</td><td>10/28/1985</td><td>East     </td><td>Midwest  </td><td>Southeast</td><td>West     </td></tr>
<tr><td style="text-align: right;"> 2</td><td style="text-align: right;">    1987</td><td>10/27/1986</td><td>East     </td><td>Southeast</td><td>Midwest  </td><td>West     </td></tr>
<tr><td style="text-align: right;"> 3</td><td style="text-align: right;">    1988</td><td>11/2/1987 </td><td>East     </td><td>Midwest  </td><td>Southeast</td><td>West     </td></tr>
<tr><td style="text-align: right;"> 4</td><td style="text-align: right;">    1989</td><td>10/31/1988</td><td>East     </td><td>West     </td><td>Midwest  </td><td>Southeast</td></tr>
</tbody>
</table>
#+END_EXPORT

** Teams
#+begin_src python :session :exports both :results output html :eval never-export
  Teams = pd.read_csv('../input/datafiles/Teams.csv')
  print("size = ", Teams.shape)
  print_df(Teams.head())
#+end_src

#+RESULTS:
#+BEGIN_EXPORT html
size =  (366, 4)
<table>
<thead>
<tr><th style="text-align: right;">  </th><th style="text-align: right;">  TeamID</th><th>TeamName   </th><th style="text-align: right;">  FirstD1Season</th><th style="text-align: right;">  LastD1Season</th></tr>
</thead>
<tbody>
<tr><td style="text-align: right;"> 0</td><td style="text-align: right;">    1101</td><td>Abilene Chr</td><td style="text-align: right;">           2014</td><td style="text-align: right;">          2019</td></tr>
<tr><td style="text-align: right;"> 1</td><td style="text-align: right;">    1102</td><td>Air Force  </td><td style="text-align: right;">           1985</td><td style="text-align: right;">          2019</td></tr>
<tr><td style="text-align: right;"> 2</td><td style="text-align: right;">    1103</td><td>Akron      </td><td style="text-align: right;">           1985</td><td style="text-align: right;">          2019</td></tr>
<tr><td style="text-align: right;"> 3</td><td style="text-align: right;">    1104</td><td>Alabama    </td><td style="text-align: right;">           1985</td><td style="text-align: right;">          2019</td></tr>
<tr><td style="text-align: right;"> 4</td><td style="text-align: right;">    1105</td><td>Alabama A&M</td><td style="text-align: right;">           2000</td><td style="text-align: right;">          2019</td></tr>
</tbody>
</table>
#+END_EXPORT

