notebooks/data.org
** SampleSubmissionStage1
#+begin_src python :session :exports both :results output html :eval never-export
  SampleSubmissionStage1 = pd.read_csv('../input/SampleSubmissionStage1.csv')
  print("size = ", SampleSubmissionStage1.shape)
  print_df(SampleSubmissionStage1.head())
#+end_src

#+RESULTS:
#+BEGIN_EXPORT html
size =  (11390, 2)
<table>
<thead>
<tr><th style="text-align: right;">  </th><th style="text-align: right;">            ID</th><th style="text-align: right;">  Pred</th></tr>
</thead>
<tbody>
<tr><td style="text-align: right;"> 0</td><td style="text-align: right;">2014_1107_1110</td><td style="text-align: right;">   0.5</td></tr>
<tr><td style="text-align: right;"> 1</td><td style="text-align: right;">2014_1107_1112</td><td style="text-align: right;">   0.5</td></tr>
<tr><td style="text-align: right;"> 2</td><td style="text-align: right;">2014_1107_1113</td><td style="text-align: right;">   0.5</td></tr>
<tr><td style="text-align: right;"> 3</td><td style="text-align: right;">2014_1107_1124</td><td style="text-align: right;">   0.5</td></tr>
<tr><td style="text-align: right;"> 4</td><td style="text-align: right;">2014_1107_1140</td><td style="text-align: right;">   0.5</td></tr>
</tbody>
</table>
#+END_EXPORT

* Data Section 2 - Team Box Scores
Variables:
- WFGM - field goals made (by the winning team)
- WFGA - field goals attempted (by the winning team)
- WFGM3 - three pointers made (by the winning team)
- WFGA3 - three pointers attempted (by the winning team)
- WFTM - free throws made (by the winning team)
- WFTA - free throws attempted (by the winning team)
- WOR - offensive rebounds (pulled by the winning team)
- WDR - defensive rebounds (pulled by the winning team)
- WAst - assists (by the winning team)
- WTO - turnovers committed (by the winning team)
- WStl - steals (accomplished by the winning team)
- WBlk - blocks (accomplished by the winning team)
- WPF - personal fouls committed (by the winning team)

** RegularSeasonDetailedResults
#+begin_src python :session :exports both :results output html :eval never-export
  RegularSeasonDetailedResults = pd.read_csv('../input/datafiles/RegularSeasonDetailedResults.csv')
  print("size = ", RegularSeasonDetailedResults.shape)
  print_df(RegularSeasonDetailedResults.head())
#+end_src

#+RESULTS:
#+BEGIN_EXPORT html
size =  (82041, 34)
<table>
<thead>
<tr><th style="text-align: right;">  </th><th style="text-align: right;">  Season</th><th style="text-align: right;">  DayNum</th><th style="text-align: right;">  WTeamID</th><th style="text-align: right;">  WScore</th><th style="text-align: right;">  LTeamID</th><th style="text-align: right;">  LScore</th><th>WLoc  </th><th style="text-align: right;">  NumOT</th><th style="text-align: right;">  WFGM</th><th style="text-align: right;">  WFGA</th><th style="text-align: right;">  WFGM3</th><th style="text-align: right;">  WFGA3</th><th style="text-align: right;">  WFTM</th><th style="text-align: right;">  WFTA</th><th style="text-align: right;">  WOR</th><th style="text-align: right;">  WDR</th><th style="text-align: right;">  WAst</th><th style="text-align: right;">  WTO</th><th style="text-align: right;">  WStl</th><th style="text-align: right;">  WBlk</th><th style="text-align: right;">  WPF</th><th style="text-align: right;">  LFGM</th><th style="text-align: right;">  LFGA</th><th style="text-align: right;">  LFGM3</th><th style="text-align: right;">  LFGA3</th><th style="text-align: right;">  LFTM</th><th style="text-align: right;">  LFTA</th><th style="text-align: right;">  LOR</th><th style="text-align: right;">  LDR</th><th style="text-align: right;">  LAst</th><th style="text-align: right;">  LTO</th><th style="text-align: right;">  LStl</th><th style="text-align: right;">  LBlk</th><th style="text-align: right;">  LPF</th></tr>
</thead>
<tbody>
<tr><td style="text-align: right;"> 0</td><td style="text-align: right;">    2003</td><td style="text-align: right;">      10</td><td style="text-align: right;">     1104</td><td style="text-align: right;">      68</td><td style="text-align: right;">     1328</td><td style="text-align: right;">      62</td><td>N     </td><td style="text-align: right;">      0</td><td style="text-align: right;">    27</td><td style="text-align: right;">    58</td><td style="text-align: right;">      3</td><td style="text-align: right;">     14</td><td style="text-align: right;">    11</td><td style="text-align: right;">    18</td><td style="text-align: right;">   14</td><td style="text-align: right;">   24</td><td style="text-align: right;">    13</td><td style="text-align: right;">   23</td><td style="text-align: right;">     7</td><td style="text-align: right;">     1</td><td style="text-align: right;">   22</td><td style="text-align: right;">    22</td><td style="text-align: right;">    53</td><td style="text-align: right;">      2</td><td style="text-align: right;">     10</td><td style="text-align: right;">    16</td><td style="text-align: right;">    22</td><td style="text-align: right;">   10</td><td style="text-align: right;">   22</td><td style="text-align: right;">     8</td><td style="text-align: right;">   18</td><td style="text-align: right;">     9</td><td style="text-align: right;">     2</td><td style="text-align: right;">   20</td></tr>
<tr><td style="text-align: right;"> 1</td><td style="text-align: right;">    2003</td><td style="text-align: right;">      10</td><td style="text-align: right;">     1272</td><td style="text-align: right;">      70</td><td style="text-align: right;">     1393</td><td style="text-align: right;">      63</td><td>N     </td><td style="text-align: right;">      0</td><td style="text-align: right;">    26</td><td style="text-align: right;">    62</td><td style="text-align: right;">      8</td><td style="text-align: right;">     20</td><td style="text-align: right;">    10</td><td style="text-align: right;">    19</td><td style="text-align: right;">   15</td><td style="text-align: right;">   28</td><td style="text-align: right;">    16</td><td style="text-align: right;">   13</td><td style="text-align: right;">     4</td><td style="text-align: right;">     4</td><td style="text-align: right;">   18</td><td style="text-align: right;">    24</td><td style="text-align: right;">    67</td><td style="text-align: right;">      6</td><td style="text-align: right;">     24</td><td style="text-align: right;">     9</td><td style="text-align: right;">    20</td><td style="text-align: right;">   20</td><td style="text-align: right;">   25</td><td style="text-align: right;">     7</td><td style="text-align: right;">   12</td><td style="text-align: right;">     8</td><td style="text-align: right;">     6</td><td style="text-align: right;">   16</td></tr>
<tr><td style="text-align: right;"> 2</td><td style="text-align: right;">    2003</td><td style="text-align: right;">      11</td><td style="text-align: right;">     1266</td><td style="text-align: right;">      73</td><td style="text-align: right;">     1437</td><td style="text-align: right;">      61</td><td>N     </td><td style="text-align: right;">      0</td><td style="text-align: right;">    24</td><td style="text-align: right;">    58</td><td style="text-align: right;">      8</td><td style="text-align: right;">     18</td><td style="text-align: right;">    17</td><td style="text-align: right;">    29</td><td style="text-align: right;">   17</td><td style="text-align: right;">   26</td><td style="text-align: right;">    15</td><td style="text-align: right;">   10</td><td style="text-align: right;">     5</td><td style="text-align: right;">     2</td><td style="text-align: right;">   25</td><td style="text-align: right;">    22</td><td style="text-align: right;">    73</td><td style="text-align: right;">      3</td><td style="text-align: right;">     26</td><td style="text-align: right;">    14</td><td style="text-align: right;">    23</td><td style="text-align: right;">   31</td><td style="text-align: right;">   22</td><td style="text-align: right;">     9</td><td style="text-align: right;">   12</td><td style="text-align: right;">     2</td><td style="text-align: right;">     5</td><td style="text-align: right;">   23</td></tr>
<tr><td style="text-align: right;"> 3</td><td style="text-align: right;">    2003</td><td style="text-align: right;">      11</td><td style="text-align: right;">     1296</td><td style="text-align: right;">      56</td><td style="text-align: right;">     1457</td><td style="text-align: right;">      50</td><td>N     </td><td style="text-align: right;">      0</td><td style="text-align: right;">    18</td><td style="text-align: right;">    38</td><td style="text-align: right;">      3</td><td style="text-align: right;">      9</td><td style="text-align: right;">    17</td><td style="text-align: right;">    31</td><td style="text-align: right;">    6</td><td style="text-align: right;">   19</td><td style="text-align: right;">    11</td><td style="text-align: right;">   12</td><td style="text-align: right;">    14</td><td style="text-align: right;">     2</td><td style="text-align: right;">   18</td><td style="text-align: right;">    18</td><td style="text-align: right;">    49</td><td style="text-align: right;">      6</td><td style="text-align: right;">     22</td><td style="text-align: right;">     8</td><td style="text-align: right;">    15</td><td style="text-align: right;">   17</td><td style="text-align: right;">   20</td><td style="text-align: right;">     9</td><td style="text-align: right;">   19</td><td style="text-align: right;">     4</td><td style="text-align: right;">     3</td><td style="text-align: right;">   23</td></tr>
<tr><td style="text-align: right;"> 4</td><td style="text-align: right;">    2003</td><td style="text-align: right;">      11</td><td style="text-align: right;">     1400</td><td style="text-align: right;">      77</td><td style="text-align: right;">     1208</td><td style="text-align: right;">      71</td><td>N     </td><td style="text-align: right;">      0</td><td style="text-align: right;">    30</td><td style="text-align: right;">    61</td><td style="text-align: right;">      6</td><td style="text-align: right;">     14</td><td style="text-align: right;">    11</td><td style="text-align: right;">    13</td><td style="text-align: right;">   17</td><td style="text-align: right;">   22</td><td style="text-align: right;">    12</td><td style="text-align: right;">   14</td><td style="text-align: right;">     4</td><td style="text-align: right;">     4</td><td style="text-align: right;">   20</td><td style="text-align: right;">    24</td><td style="text-align: right;">    62</td><td style="text-align: right;">      6</td><td style="text-align: right;">     16</td><td style="text-align: right;">    17</td><td style="text-align: right;">    27</td><td style="text-align: right;">   21</td><td style="text-align: right;">   15</td><td style="text-align: right;">    12</td><td style="text-align: right;">   10</td><td style="text-align: right;">     7</td><td style="text-align: right;">     1</td><td style="text-align: right;">   14</td></tr>
</tbody>
</table>
#+END_EXPORT
