docs/data.html

<div id="outline-container-org5f005a6" class="outline-3">
<h3 id="org5f005a6">SampleSubmissionStage1</h3>
<div class="outline-text-3" id="text-org5f005a6">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">SampleSubmissionStage1</span> = pd.read_csv(<span style="color: #8b2252;">'../input/SampleSubmissionStage1.csv'</span>)
<span style="color: #a020f0;">print</span>(<span style="color: #8b2252;">"size = "</span>, SampleSubmissionStage1.shape)
print_df(SampleSubmissionStage1.head())
</pre>
</div>

size =  (11390, 2)
<table>
<thead>
<tr><th style="text-align: right;">  </th><th style="text-align: right;">            ID</th><th style="text-align: right;">  Pred</th></tr>
</thead>
<tbody>
<tr><td style="text-align: right;"> 0</td><td style="text-align: right;">2014_1107_1110</td><td style="text-align: right;">   0.5</td></tr>
<tr><td style="text-align: right;"> 1</td><td style="text-align: right;">2014_1107_1112</td><td style="text-align: right;">   0.5</td></tr>
<tr><td style="text-align: right;"> 2</td><td style="text-align: right;">2014_1107_1113</td><td style="text-align: right;">   0.5</td></tr>
<tr><td style="text-align: right;"> 3</td><td style="text-align: right;">2014_1107_1124</td><td style="text-align: right;">   0.5</td></tr>
<tr><td style="text-align: right;"> 4</td><td style="text-align: right;">2014_1107_1140</td><td style="text-align: right;">   0.5</td></tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-org3b44356" class="outline-2">
<h2 id="org3b44356">Data Section 2 - Team Box Scores</h2>
<div class="outline-text-2" id="text-org3b44356">
<p>
Variables:
</p>
<ul class="org-ul">
<li>WFGM - field goals made (by the winning team)</li>
<li>WFGA - field goals attempted (by the winning team)</li>
<li>WFGM3 - three pointers made (by the winning team)</li>
<li>WFGA3 - three pointers attempted (by the winning team)</li>
<li>WFTM - free throws made (by the winning team)</li>
<li>WFTA - free throws attempted (by the winning team)</li>
<li>WOR - offensive rebounds (pulled by the winning team)</li>
<li>WDR - defensive rebounds (pulled by the winning team)</li>
<li>WAst - assists (by the winning team)</li>
<li>WTO - turnovers committed (by the winning team)</li>
<li>WStl - steals (accomplished by the winning team)</li>
<li>WBlk - blocks (accomplished by the winning team)</li>
<li>WPF - personal fouls committed (by the winning team)</li>
</ul>
</div>
