notebooks/data.org
** NCAATourneyDetailedResults
#+begin_src python :session :exports both :results output html :eval never-export
  NCAATourneyDetailedResults = pd.read_csv('../input/datafiles/NCAATourneyDetailedResults.csv')
  print("size = ", NCAATourneyDetailedResults.shape)
  print_df(NCAATourneyDetailedResults.head())
#+end_src

#+RESULTS:
#+BEGIN_EXPORT html
size =  (1048, 34)
<table>
<thead>
<tr><th style="text-align: right;">  </th><th style="text-align: right;">  Season</th><th style="text-align: right;">  DayNum</th><th style="text-align: right;">  WTeamID</th><th style="text-align: right;">  WScore</th><th style="text-align: right;">  LTeamID</th><th style="text-align: right;">  LScore</th><th>WLoc  </th><th style="text-align: right;">  NumOT</th><th style="text-align: right;">  WFGM</th><th style="text-align: right;">  WFGA</th><th style="text-align: right;">  WFGM3</th><th style="text-align: right;">  WFGA3</th><th style="text-align: right;">  WFTM</th><th style="text-align: right;">  WFTA</th><th style="text-align: right;">  WOR</th><th style="text-align: right;">  WDR</th><th style="text-align: right;">  WAst</th><th style="text-align: right;">  WTO</th><th style="text-align: right;">  WStl</th><th style="text-align: right;">  WBlk</th><th style="text-align: right;">  WPF</th><th style="text-align: right;">  LFGM</th><th style="text-align: right;">  LFGA</th><th style="text-align: right;">  LFGM3</th><th style="text-align: right;">  LFGA3</th><th style="text-align: right;">  LFTM</th><th style="text-align: right;">  LFTA</th><th style="text-align: right;">  LOR</th><th style="text-align: right;">  LDR</th><th style="text-align: right;">  LAst</th><th style="text-align: right;">  LTO</th><th style="text-align: right;">  LStl</th><th style="text-align: right;">  LBlk</th><th style="text-align: right;">  LPF</th></tr>
</thead>
<tbody>
<tr><td style="text-align: right;"> 0</td><td style="text-align: right;">    2003</td><td style="text-align: right;">     134</td><td style="text-align: right;">     1421</td><td style="text-align: right;">      92</td><td style="text-align: right;">     1411</td><td style="text-align: right;">      84</td><td>N     </td><td style="text-align: right;">      1</td><td style="text-align: right;">    32</td><td style="text-align: right;">    69</td><td style="text-align: right;">     11</td><td style="text-align: right;">     29</td><td style="text-align: right;">    17</td><td style="text-align: right;">    26</td><td style="text-align: right;">   14</td><td style="text-align: right;">   30</td><td style="text-align: right;">    17</td><td style="text-align: right;">   12</td><td style="text-align: right;">     5</td><td style="text-align: right;">     3</td><td style="text-align: right;">   22</td><td style="text-align: right;">    29</td><td style="text-align: right;">    67</td><td style="text-align: right;">     12</td><td style="text-align: right;">     31</td><td style="text-align: right;">    14</td><td style="text-align: right;">    31</td><td style="text-align: right;">   17</td><td style="text-align: right;">   28</td><td style="text-align: right;">    16</td><td style="text-align: right;">   15</td><td style="text-align: right;">     5</td><td style="text-align: right;">     0</td><td style="text-align: right;">   22</td></tr>
<tr><td style="text-align: right;"> 1</td><td style="text-align: right;">    2003</td><td style="text-align: right;">     136</td><td style="text-align: right;">     1112</td><td style="text-align: right;">      80</td><td style="text-align: right;">     1436</td><td style="text-align: right;">      51</td><td>N     </td><td style="text-align: right;">      0</td><td style="text-align: right;">    31</td><td style="text-align: right;">    66</td><td style="text-align: right;">      7</td><td style="text-align: right;">     23</td><td style="text-align: right;">    11</td><td style="text-align: right;">    14</td><td style="text-align: right;">   11</td><td style="text-align: right;">   36</td><td style="text-align: right;">    22</td><td style="text-align: right;">   16</td><td style="text-align: right;">    10</td><td style="text-align: right;">     7</td><td style="text-align: right;">    8</td><td style="text-align: right;">    20</td><td style="text-align: right;">    64</td><td style="text-align: right;">      4</td><td style="text-align: right;">     16</td><td style="text-align: right;">     7</td><td style="text-align: right;">     7</td><td style="text-align: right;">    8</td><td style="text-align: right;">   26</td><td style="text-align: right;">    12</td><td style="text-align: right;">   17</td><td style="text-align: right;">    10</td><td style="text-align: right;">     3</td><td style="text-align: right;">   15</td></tr>
<tr><td style="text-align: right;"> 2</td><td style="text-align: right;">    2003</td><td style="text-align: right;">     136</td><td style="text-align: right;">     1113</td><td style="text-align: right;">      84</td><td style="text-align: right;">     1272</td><td style="text-align: right;">      71</td><td>N     </td><td style="text-align: right;">      0</td><td style="text-align: right;">    31</td><td style="text-align: right;">    59</td><td style="text-align: right;">      6</td><td style="text-align: right;">     14</td><td style="text-align: right;">    16</td><td style="text-align: right;">    22</td><td style="text-align: right;">   10</td><td style="text-align: right;">   27</td><td style="text-align: right;">    18</td><td style="text-align: right;">    9</td><td style="text-align: right;">     7</td><td style="text-align: right;">     4</td><td style="text-align: right;">   19</td><td style="text-align: right;">    25</td><td style="text-align: right;">    69</td><td style="text-align: right;">      7</td><td style="text-align: right;">     28</td><td style="text-align: right;">    14</td><td style="text-align: right;">    21</td><td style="text-align: right;">   20</td><td style="text-align: right;">   22</td><td style="text-align: right;">    11</td><td style="text-align: right;">   12</td><td style="text-align: right;">     2</td><td style="text-align: right;">     5</td><td style="text-align: right;">   18</td></tr>
<tr><td style="text-align: right;"> 3</td><td style="text-align: right;">    2003</td><td style="text-align: right;">     136</td><td style="text-align: right;">     1141</td><td style="text-align: right;">      79</td><td style="text-align: right;">     1166</td><td style="text-align: right;">      73</td><td>N     </td><td style="text-align: right;">      0</td><td style="text-align: right;">    29</td><td style="text-align: right;">    53</td><td style="text-align: right;">      3</td><td style="text-align: right;">      7</td><td style="text-align: right;">    18</td><td style="text-align: right;">    25</td><td style="text-align: right;">   11</td><td style="text-align: right;">   20</td><td style="text-align: right;">    15</td><td style="text-align: right;">   18</td><td style="text-align: right;">    13</td><td style="text-align: right;">     1</td><td style="text-align: right;">   19</td><td style="text-align: right;">    27</td><td style="text-align: right;">    60</td><td style="text-align: right;">      7</td><td style="text-align: right;">     17</td><td style="text-align: right;">    12</td><td style="text-align: right;">    17</td><td style="text-align: right;">   14</td><td style="text-align: right;">   17</td><td style="text-align: right;">    20</td><td style="text-align: right;">   21</td><td style="text-align: right;">     6</td><td style="text-align: right;">     6</td><td style="text-align: right;">   21</td></tr>
<tr><td style="text-align: right;"> 4</td><td style="text-align: right;">    2003</td><td style="text-align: right;">     136</td><td style="text-align: right;">     1143</td><td style="text-align: right;">      76</td><td style="text-align: right;">     1301</td><td style="text-align: right;">      74</td><td>N     </td><td style="text-align: right;">      1</td><td style="text-align: right;">    27</td><td style="text-align: right;">    64</td><td style="text-align: right;">      7</td><td style="text-align: right;">     20</td><td style="text-align: right;">    15</td><td style="text-align: right;">    23</td><td style="text-align: right;">   18</td><td style="text-align: right;">   20</td><td style="text-align: right;">    17</td><td style="text-align: right;">   13</td><td style="text-align: right;">     8</td><td style="text-align: right;">     2</td><td style="text-align: right;">   14</td><td style="text-align: right;">    25</td><td style="text-align: right;">    56</td><td style="text-align: right;">      9</td><td style="text-align: right;">     21</td><td style="text-align: right;">    15</td><td style="text-align: right;">    20</td><td style="text-align: right;">   10</td><td style="text-align: right;">   26</td><td style="text-align: right;">    16</td><td style="text-align: right;">   14</td><td style="text-align: right;">     5</td><td style="text-align: right;">     8</td><td style="text-align: right;">   19</td></tr>
</tbody>
</table>
#+END_EXPORT
