notebooks/data.org
** Cities
#+begin_src python :session :exports both :results output html :eval never-export
  Cities = pd.read_csv('../input/datafiles/Cities.csv')
  print("size = ", Cities.shape)
  print_df(Cities.head())
#+end_src

#+RESULTS:
#+BEGIN_EXPORT html
size =  (421, 3)
<table>
<thead>
<tr><th style="text-align: right;">  </th><th style="text-align: right;">  CityID</th><th>City       </th><th>State  </th></tr>
</thead>
<tbody>
<tr><td style="text-align: right;"> 0</td><td style="text-align: right;">    4001</td><td>Abilene    </td><td>TX     </td></tr>
<tr><td style="text-align: right;"> 1</td><td style="text-align: right;">    4002</td><td>Akron      </td><td>OH     </td></tr>
<tr><td style="text-align: right;"> 2</td><td style="text-align: right;">    4003</td><td>Albany     </td><td>NY     </td></tr>
<tr><td style="text-align: right;"> 3</td><td style="text-align: right;">    4004</td><td>Albuquerque</td><td>NM     </td></tr>
<tr><td style="text-align: right;"> 4</td><td style="text-align: right;">    4005</td><td>Allentown  </td><td>PA     </td></tr>
</tbody>
</table>
#+END_EXPORT
** GameCities
#+begin_src python :session :exports both :results output html :eval never-export
  GameCities = pd.read_csv('../input/datafiles/GameCities.csv')
  print("size = ", GameCities.shape)
  print_df(GameCities.head())
#+end_src

#+RESULTS:
#+BEGIN_EXPORT html
size =  (49235, 6)
<table>
<thead>
<tr><th style="text-align: right;">  </th><th style="text-align: right;">  Season</th><th style="text-align: right;">  DayNum</th><th style="text-align: right;">  WTeamID</th><th style="text-align: right;">  LTeamID</th><th>CRType  </th><th style="text-align: right;">  CityID</th></tr>
</thead>
<tbody>
<tr><td style="text-align: right;"> 0</td><td style="text-align: right;">    2010</td><td style="text-align: right;">       7</td><td style="text-align: right;">     1143</td><td style="text-align: right;">     1293</td><td>Regular </td><td style="text-align: right;">    4027</td></tr>
<tr><td style="text-align: right;"> 1</td><td style="text-align: right;">    2010</td><td style="text-align: right;">       7</td><td style="text-align: right;">     1314</td><td style="text-align: right;">     1198</td><td>Regular </td><td style="text-align: right;">    4061</td></tr>
<tr><td style="text-align: right;"> 2</td><td style="text-align: right;">    2010</td><td style="text-align: right;">       7</td><td style="text-align: right;">     1326</td><td style="text-align: right;">     1108</td><td>Regular </td><td style="text-align: right;">    4080</td></tr>
<tr><td style="text-align: right;"> 3</td><td style="text-align: right;">    2010</td><td style="text-align: right;">       7</td><td style="text-align: right;">     1393</td><td style="text-align: right;">     1107</td><td>Regular </td><td style="text-align: right;">    4340</td></tr>
<tr><td style="text-align: right;"> 4</td><td style="text-align: right;">    2010</td><td style="text-align: right;">       9</td><td style="text-align: right;">     1143</td><td style="text-align: right;">     1178</td><td>Regular </td><td style="text-align: right;">    4027</td></tr>
</tbody>
</table>
#+END_EXPORT
* Data Section 4 - Public Rankings
** MasseyOrdinals
#+begin_src python :session :exports both :results output html :eval never-export
  MasseyOrdinals = pd.read_csv('../input/datafiles/MasseyOrdinals.csv')
  print("size = ", MasseyOrdinals.shape)
  print_df(MasseyOrdinals.head())
#+end_src

#+RESULTS:
#+BEGIN_EXPORT html
size =  (3492320, 5)
<table>
<thead>
<tr><th style="text-align: right;">  </th><th style="text-align: right;">  Season</th><th style="text-align: right;">  RankingDayNum</th><th>SystemName  </th><th style="text-align: right;">  TeamID</th><th style="text-align: right;">  OrdinalRank</th></tr>
</thead>
<tbody>
<tr><td style="text-align: right;"> 0</td><td style="text-align: right;">    2003</td><td style="text-align: right;">             35</td><td>SEL         </td><td style="text-align: right;">    1102</td><td style="text-align: right;">          159</td></tr>
<tr><td style="text-align: right;"> 1</td><td style="text-align: right;">    2003</td><td style="text-align: right;">             35</td><td>SEL         </td><td style="text-align: right;">    1103</td><td style="text-align: right;">          229</td></tr>
<tr><td style="text-align: right;"> 2</td><td style="text-align: right;">    2003</td><td style="text-align: right;">             35</td><td>SEL         </td><td style="text-align: right;">    1104</td><td style="text-align: right;">           12</td></tr>
<tr><td style="text-align: right;"> 3</td><td style="text-align: right;">    2003</td><td style="text-align: right;">             35</td><td>SEL         </td><td style="text-align: right;">    1105</td><td style="text-align: right;">          314</td></tr>
<tr><td style="text-align: right;"> 4</td><td style="text-align: right;">    2003</td><td style="text-align: right;">             35</td><td>SEL         </td><td style="text-align: right;">    1106</td><td style="text-align: right;">          260</td></tr>
</tbody>
</table>
#+END_EXPORT

* Data Section 5 - Play by Play
