notebooks/data.org
** Events_2015
#+begin_src python :session :exports both :results output html :eval never-export
  Events_2015 = pd.read_csv('../input/datafiles/Events_2015.csv')
  print("size = ", Events_2015.shape)
  print_df(Events_2015.head())
#+end_src

#+RESULTS:
#+BEGIN_EXPORT html
size =  (2548633, 11)
<table>
<thead>
<tr><th style="text-align: right;">  </th><th style="text-align: right;">  EventID</th><th style="text-align: right;">  Season</th><th style="text-align: right;">  DayNum</th><th style="text-align: right;">  WTeamID</th><th style="text-align: right;">  LTeamID</th><th style="text-align: right;">  WPoints</th><th style="text-align: right;">  LPoints</th><th style="text-align: right;">  ElapsedSeconds</th><th style="text-align: right;">  EventTeamID</th><th style="text-align: right;">  EventPlayerID</th><th>EventType  </th></tr>
</thead>
<tbody>
<tr><td style="text-align: right;"> 0</td><td style="text-align: right;"> 12703749</td><td style="text-align: right;">    2015</td><td style="text-align: right;">      11</td><td style="text-align: right;">     1103</td><td style="text-align: right;">     1420</td><td style="text-align: right;">        0</td><td style="text-align: right;">        0</td><td style="text-align: right;">              19</td><td style="text-align: right;">         1103</td><td style="text-align: right;">         626476</td><td>miss3_jump </td></tr>
<tr><td style="text-align: right;"> 1</td><td style="text-align: right;"> 12703750</td><td style="text-align: right;">    2015</td><td style="text-align: right;">      11</td><td style="text-align: right;">     1103</td><td style="text-align: right;">     1420</td><td style="text-align: right;">        0</td><td style="text-align: right;">        0</td><td style="text-align: right;">              19</td><td style="text-align: right;">         1420</td><td style="text-align: right;">         631228</td><td>reb_def    </td></tr>
<tr><td style="text-align: right;"> 2</td><td style="text-align: right;"> 12703751</td><td style="text-align: right;">    2015</td><td style="text-align: right;">      11</td><td style="text-align: right;">     1103</td><td style="text-align: right;">     1420</td><td style="text-align: right;">        0</td><td style="text-align: right;">        0</td><td style="text-align: right;">              27</td><td style="text-align: right;">         1420</td><td style="text-align: right;">         631233</td><td>assist     </td></tr>
<tr><td style="text-align: right;"> 3</td><td style="text-align: right;"> 12703752</td><td style="text-align: right;">    2015</td><td style="text-align: right;">      11</td><td style="text-align: right;">     1103</td><td style="text-align: right;">     1420</td><td style="text-align: right;">        0</td><td style="text-align: right;">        2</td><td style="text-align: right;">              27</td><td style="text-align: right;">         1420</td><td style="text-align: right;">         631230</td><td>made2_dunk </td></tr>
<tr><td style="text-align: right;"> 4</td><td style="text-align: right;"> 12703753</td><td style="text-align: right;">    2015</td><td style="text-align: right;">      11</td><td style="text-align: right;">     1103</td><td style="text-align: right;">     1420</td><td style="text-align: right;">        2</td><td style="text-align: right;">        2</td><td style="text-align: right;">              59</td><td style="text-align: right;">         1103</td><td style="text-align: right;">         626468</td><td>made2_jump </td></tr>
</tbody>
</table>
#+END_EXPORT

** Players_2015
#+begin_src python :session :exports both :results output html :eval never-export
  Players_2015 = pd.read_csv('../input/datafiles/Players_2015.csv')
  print("size = ", Players_2015.shape)
  print_df(Players_2015.head())
#+end_src

#+RESULTS:
#+BEGIN_EXPORT html
size =  (5442, 4)
<table>
<thead>
<tr><th style="text-align: right;">  </th><th style="text-align: right;">  PlayerID</th><th style="text-align: right;">  Season</th><th style="text-align: right;">  TeamID</th><th>PlayerName        </th></tr>
</thead>
<tbody>
<tr><td style="text-align: right;"> 0</td><td style="text-align: right;">    626432</td><td style="text-align: right;">    2015</td><td style="text-align: right;">    1101</td><td>ALBRIGHT_CHRISTIAN</td></tr>
<tr><td style="text-align: right;"> 1</td><td style="text-align: right;">    626433</td><td style="text-align: right;">    2015</td><td style="text-align: right;">    1101</td><td>COOKE_AUSTIN      </td></tr>
<tr><td style="text-align: right;"> 2</td><td style="text-align: right;">    626434</td><td style="text-align: right;">    2015</td><td style="text-align: right;">    1101</td><td>GRANT_MICHAEL     </td></tr>
<tr><td style="text-align: right;"> 3</td><td style="text-align: right;">    626435</td><td style="text-align: right;">    2015</td><td style="text-align: right;">    1101</td><td>GREEN_DRAKE       </td></tr>
<tr><td style="text-align: right;"> 4</td><td style="text-align: right;">    626436</td><td style="text-align: right;">    2015</td><td style="text-align: right;">    1101</td><td>HANSON_DAVID      </td></tr>
</tbody>
</table>
#+END_EXPORT
* Data Section 6 - Supplements
** ConferenceTourneyGames
#+begin_src python :session :exports both :results output html :eval never-export
  Conference Tourney Games = pd.read_csv('../input/datafiles/ConferenceTourneyGames.csv')
  print("size = ", Conference Tourney Games.shape)
  print_df(Conference Tourney Games.head())
#+end_src

#+RESULTS:
#+BEGIN_EXPORT html
Traceback (most recent call last):
  File "<stdin>", line 1, in <module>
  File "/tmp/babel-7PnAYV/python-KdmXXV", line 1
    Conference Tourney Games = pd.read_csv('../input/datafiles/ConferenceTourneyGames.csv')
                     ^
SyntaxError: invalid syntax
#+END_EXPORT

