notebooks/data.org
** TeamCoaches
#+begin_src python :session :exports both :results output html :eval never-export
  TeamCoaches = pd.read_csv('../input/datafiles/TeamCoaches.csv')
  print("size = ", TeamCoaches.shape)
  print_df(TeamCoaches.head())
#+end_src

#+RESULTS:
#+BEGIN_EXPORT html
size =  (10994, 5)
<table>
<thead>
<tr><th style="text-align: right;">  </th><th style="text-align: right;">  Season</th><th style="text-align: right;">  TeamID</th><th style="text-align: right;">  FirstDayNum</th><th style="text-align: right;">  LastDayNum</th><th>CoachName     </th></tr>
</thead>
<tbody>
<tr><td style="text-align: right;"> 0</td><td style="text-align: right;">    1985</td><td style="text-align: right;">    1102</td><td style="text-align: right;">            0</td><td style="text-align: right;">         154</td><td>reggie_minton </td></tr>
<tr><td style="text-align: right;"> 1</td><td style="text-align: right;">    1985</td><td style="text-align: right;">    1103</td><td style="text-align: right;">            0</td><td style="text-align: right;">         154</td><td>bob_huggins   </td></tr>
<tr><td style="text-align: right;"> 2</td><td style="text-align: right;">    1985</td><td style="text-align: right;">    1104</td><td style="text-align: right;">            0</td><td style="text-align: right;">         154</td><td>wimp_sanderson</td></tr>
<tr><td style="text-align: right;"> 3</td><td style="text-align: right;">    1985</td><td style="text-align: right;">    1106</td><td style="text-align: right;">            0</td><td style="text-align: right;">         154</td><td>james_oliver  </td></tr>
<tr><td style="text-align: right;"> 4</td><td style="text-align: right;">    1985</td><td style="text-align: right;">    1108</td><td style="text-align: right;">            0</td><td style="text-align: right;">         154</td><td>davey_whitney </td></tr>
</tbody>
</table>
#+END_EXPORT

** Conferences
#+begin_src python :session :exports both :results output html :eval never-export
  Conferences = pd.read_csv('../input/datafiles/Conferences.csv')
  print("size = ", Conferences.shape)
  print_df(Conferences.head())
#+end_src

#+RESULTS:
#+BEGIN_EXPORT html
size =  (51, 2)
<table>
<thead>
<tr><th style="text-align: right;">  </th><th>ConfAbbrev  </th><th>Description                 </th></tr>
</thead>
<tbody>
<tr><td style="text-align: right;"> 0</td><td>a_sun       </td><td>Atlantic Sun Conference     </td></tr>
<tr><td style="text-align: right;"> 1</td><td>a_ten       </td><td>Atlantic 10 Conference      </td></tr>
<tr><td style="text-align: right;"> 2</td><td>aac         </td><td>American Athletic Conference</td></tr>
<tr><td style="text-align: right;"> 3</td><td>acc         </td><td>Atlantic Coast Conference   </td></tr>
<tr><td style="text-align: right;"> 4</td><td>aec         </td><td>America East Conference     </td></tr>
</tbody>
</table>
#+END_EXPORT

** TeamConferences
#+begin_src python :session :exports both :results output html :eval never-export
  TeamConferences = pd.read_csv('../input/datafiles/TeamConferences.csv')
  print("size = ", TeamConferences.shape)
  print_df(TeamConferences.head())
#+end_src

#+RESULTS:
#+BEGIN_EXPORT html
size =  (11241, 3)
<table>
<thead>
<tr><th style="text-align: right;">  </th><th style="text-align: right;">  Season</th><th style="text-align: right;">  TeamID</th><th>ConfAbbrev  </th></tr>
</thead>
<tbody>
<tr><td style="text-align: right;"> 0</td><td style="text-align: right;">    1985</td><td style="text-align: right;">    1114</td><td>a_sun       </td></tr>
<tr><td style="text-align: right;"> 1</td><td style="text-align: right;">    1985</td><td style="text-align: right;">    1147</td><td>a_sun       </td></tr>
<tr><td style="text-align: right;"> 2</td><td style="text-align: right;">    1985</td><td style="text-align: right;">    1204</td><td>a_sun       </td></tr>
<tr><td style="text-align: right;"> 3</td><td style="text-align: right;">    1985</td><td style="text-align: right;">    1209</td><td>a_sun       </td></tr>
<tr><td style="text-align: right;"> 4</td><td style="text-align: right;">    1985</td><td style="text-align: right;">    1215</td><td>a_sun       </td></tr>
</tbody>
</table>
#+END_EXPORT

** SecondaryTourneyTeams
#+begin_src python :session :exports both :results output html :eval never-export
  SecondaryTourneyTeams = pd.read_csv('../input/datafiles/SecondaryTourneyTeams.csv')
  print("size = ", SecondaryTourneyTeams.shape)
  print_df(SecondaryTourneyTeams.head())
#+end_src

#+RESULTS:
#+BEGIN_EXPORT html
size =  (1568, 3)
<table>
<thead>
<tr><th style="text-align: right;">  </th><th style="text-align: right;">  Season</th><th>SecondaryTourney  </th><th style="text-align: right;">  TeamID</th></tr>
</thead>
<tbody>
<tr><td style="text-align: right;"> 0</td><td style="text-align: right;">    1985</td><td>NIT               </td><td style="text-align: right;">    1108</td></tr>
<tr><td style="text-align: right;"> 1</td><td style="text-align: right;">    1985</td><td>NIT               </td><td style="text-align: right;">    1133</td></tr>
<tr><td style="text-align: right;"> 2</td><td style="text-align: right;">    1985</td><td>NIT               </td><td style="text-align: right;">    1139</td></tr>
<tr><td style="text-align: right;"> 3</td><td style="text-align: right;">    1985</td><td>NIT               </td><td style="text-align: right;">    1145</td></tr>
<tr><td style="text-align: right;"> 4</td><td style="text-align: right;">    1985</td><td>NIT               </td><td style="text-align: right;">    1151</td></tr>
</tbody>
</table>
#+END_EXPORT

** SecondaryTourneyCompactResults
#+begin_src python :session :exports both :results output html :eval never-export
  SecondaryTourneyCompactResults = pd.read_csv('../input/datafiles/SecondaryTourneyCompactResults.csv')
  print("size = ", SecondaryTourneyCompactResults.shape)
  print_df(SecondaryTourneyCompactResults.head())
#+end_src

#+RESULTS:
#+BEGIN_EXPORT html
size =  (1551, 9)
<table>
<thead>
<tr><th style="text-align: right;">  </th><th style="text-align: right;">  Season</th><th style="text-align: right;">  DayNum</th><th style="text-align: right;">  WTeamID</th><th style="text-align: right;">  WScore</th><th style="text-align: right;">  LTeamID</th><th style="text-align: right;">  LScore</th><th>WLoc  </th><th style="text-align: right;">  NumOT</th><th>SecondaryTourney  </th></tr>
</thead>
<tbody>
<tr><td style="text-align: right;"> 0</td><td style="text-align: right;">    1985</td><td style="text-align: right;">     136</td><td style="text-align: right;">     1151</td><td style="text-align: right;">      67</td><td style="text-align: right;">     1155</td><td style="text-align: right;">      65</td><td>H     </td><td style="text-align: right;">      0</td><td>NIT               </td></tr>
<tr><td style="text-align: right;"> 1</td><td style="text-align: right;">    1985</td><td style="text-align: right;">     136</td><td style="text-align: right;">     1153</td><td style="text-align: right;">      77</td><td style="text-align: right;">     1245</td><td style="text-align: right;">      61</td><td>H     </td><td style="text-align: right;">      0</td><td>NIT               </td></tr>
<tr><td style="text-align: right;"> 2</td><td style="text-align: right;">    1985</td><td style="text-align: right;">     136</td><td style="text-align: right;">     1201</td><td style="text-align: right;">      79</td><td style="text-align: right;">     1365</td><td style="text-align: right;">      76</td><td>H     </td><td style="text-align: right;">      0</td><td>NIT               </td></tr>
<tr><td style="text-align: right;"> 3</td><td style="text-align: right;">    1985</td><td style="text-align: right;">     136</td><td style="text-align: right;">     1231</td><td style="text-align: right;">      79</td><td style="text-align: right;">     1139</td><td style="text-align: right;">      57</td><td>H     </td><td style="text-align: right;">      0</td><td>NIT               </td></tr>
<tr><td style="text-align: right;"> 4</td><td style="text-align: right;">    1985</td><td style="text-align: right;">     136</td><td style="text-align: right;">     1249</td><td style="text-align: right;">      78</td><td style="text-align: right;">     1222</td><td style="text-align: right;">      71</td><td>H     </td><td style="text-align: right;">      0</td><td>NIT               </td></tr>
</tbody>
</table>
#+END_EXPORT

