notebooks/data.org
** NCAATourneySlots
#+begin_src python :session :exports both :results output html :eval never-export
  NCAATourneySlots = pd.read_csv('../input/datafiles/NCAATourneySlots.csv')
  print("size = ", NCAATourneySlots.shape)
  print_df(NCAATourneySlots.head())
#+end_src

#+RESULTS:
#+BEGIN_EXPORT html
size =  (2184, 4)
<table>
<thead>
<tr><th style="text-align: right;">  </th><th style="text-align: right;">  Season</th><th>Slot  </th><th>StrongSeed  </th><th>WeakSeed  </th></tr>
</thead>
<tbody>
<tr><td style="text-align: right;"> 0</td><td style="text-align: right;">    1985</td><td>R1W1  </td><td>W01         </td><td>W16       </td></tr>
<tr><td style="text-align: right;"> 1</td><td style="text-align: right;">    1985</td><td>R1W2  </td><td>W02         </td><td>W15       </td></tr>
<tr><td style="text-align: right;"> 2</td><td style="text-align: right;">    1985</td><td>R1W3  </td><td>W03         </td><td>W14       </td></tr>
<tr><td style="text-align: right;"> 3</td><td style="text-align: right;">    1985</td><td>R1W4  </td><td>W04         </td><td>W13       </td></tr>
<tr><td style="text-align: right;"> 4</td><td style="text-align: right;">    1985</td><td>R1W5  </td><td>W05         </td><td>W12       </td></tr>
</tbody>
</table>
#+END_EXPORT

** NCAATourneySeedRoundSlots
#+begin_src python :session :exports both :results output html :eval never-export
  NCAATourneySeedRoundSlots = pd.read_csv('../input/datafiles/NCAATourneySeedRoundSlots.csv')
  print("size = ", NCAATourneySeedRoundSlots.shape)
  print_df(NCAATourneySeedRoundSlots.head())
#+end_src

#+RESULTS:
#+BEGIN_EXPORT html
size =  (720, 5)
<table>
<thead>
<tr><th style="text-align: right;">  </th><th>Seed  </th><th style="text-align: right;">  GameRound</th><th>GameSlot  </th><th style="text-align: right;">  EarlyDayNum</th><th style="text-align: right;">  LateDayNum</th></tr>
</thead>
<tbody>
<tr><td style="text-align: right;"> 0</td><td>W01   </td><td style="text-align: right;">          1</td><td>R1W1      </td><td style="text-align: right;">          136</td><td style="text-align: right;">         137</td></tr>
<tr><td style="text-align: right;"> 1</td><td>W01   </td><td style="text-align: right;">          2</td><td>R2W1      </td><td style="text-align: right;">          138</td><td style="text-align: right;">         139</td></tr>
<tr><td style="text-align: right;"> 2</td><td>W01   </td><td style="text-align: right;">          3</td><td>R3W1      </td><td style="text-align: right;">          143</td><td style="text-align: right;">         144</td></tr>
<tr><td style="text-align: right;"> 3</td><td>W01   </td><td style="text-align: right;">          4</td><td>R4W1      </td><td style="text-align: right;">          145</td><td style="text-align: right;">         146</td></tr>
<tr><td style="text-align: right;"> 4</td><td>W01   </td><td style="text-align: right;">          5</td><td>R5WX      </td><td style="text-align: right;">          152</td><td style="text-align: right;">         152</td></tr>
</tbody>
</table>
#+END_EXPORT
